      * Définition de la structure de date
       01 DATE-STRUCTURE.
          05 DATE-YEAR            PIC 9(4).
          05 DATE-MONTH           PIC 9(2).
          05 DATE-DAY             PIC 9(2).
