      * Constantes pour les opérations sur les chaînes
       01 STRING-CONSTANTS.
          05 MAX-STRING-LENGTH    PIC 9(4) VALUE 1000.
          05 DEFAULT-PADDING      PIC X VALUE SPACE.
