      * Définitions pour le gestionnaire de fichiers
       01 FILE-HANDLER-CONSTANTS.
          05 FILE-STATUS-OK       PIC 9(2) VALUE 0.
          05 FILE-STATUS-ERROR    PIC 9(2) VALUE 1.
          05 FILE-STATUS-NONAME   PIC 9(2) VALUE 2.
